espressif/esp-idf/components/soc/esp32c5/register/soc/lp_i2c_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_I2C_SCL_LOW_PERIOD_REG register
 *  Configures the low level width of the SCL
 *  Clock
 */
#define LP_I2C_SCL_LOW_PERIOD_REG (DR_REG_LP_I2C_BASE + 0x0)
/** LP_I2C_SCL_LOW_PERIOD : R/W; bitpos: [8:0]; default: 0;
 *  This register is used to configure for how long SCL remains low in master mode, in
 *  I2C module clock cycles.
 */
#define LP_I2C_SCL_LOW_PERIOD    0x000001FFU
#define LP_I2C_SCL_LOW_PERIOD_M  (LP_I2C_SCL_LOW_PERIOD_V << LP_I2C_SCL_LOW_PERIOD_S)
#define LP_I2C_SCL_LOW_PERIOD_V  0x000001FFU
#define LP_I2C_SCL_LOW_PERIOD_S  0

/** LP_I2C_CTR_REG register
 *  Transmission setting
 */
#define LP_I2C_CTR_REG (DR_REG_LP_I2C_BASE + 0x4)
/** LP_I2C_SDA_FORCE_OUT : R/W; bitpos: [0]; default: 0;
 *  1: direct output, 0: open drain output.
 */
#define LP_I2C_SDA_FORCE_OUT    (BIT(0))
#define LP_I2C_SDA_FORCE_OUT_M  (LP_I2C_SDA_FORCE_OUT_V << LP_I2C_SDA_FORCE_OUT_S)
#define LP_I2C_SDA_FORCE_OUT_V  0x00000001U
#define LP_I2C_SDA_FORCE_OUT_S  0
/** LP_I2C_SCL_FORCE_OUT : R/W; bitpos: [1]; default: 0;
 *  1: direct output, 0: open drain output.
 */
#define LP_I2C_SCL_FORCE_OUT    (BIT(1))
#define LP_I2C_SCL_FORCE_OUT_M  (LP_I2C_SCL_FORCE_OUT_V << LP_I2C_SCL_FORCE_OUT_S)
#define LP_I2C_SCL_FORCE_OUT_V  0x00000001U
#define LP_I2C_SCL_FORCE_OUT_S  1
/** LP_I2C_SAMPLE_SCL_LEVEL : R/W; bitpos: [2]; default: 0;
 *  This register is used to select the sample mode.1: sample SDA data on the SCL low
 *  level.0: sample SDA data on the SCL high level.
 */
#define LP_I2C_SAMPLE_SCL_LEVEL    (BIT(2))
#define LP_I2C_SAMPLE_SCL_LEVEL_M  (LP_I2C_SAMPLE_SCL_LEVEL_V << LP_I2C_SAMPLE_SCL_LEVEL_S)
#define LP_I2C_SAMPLE_SCL_LEVEL_V  0x00000001U
#define LP_I2C_SAMPLE_SCL_LEVEL_S  2
/** LP_I2C_RX_FULL_ACK_LEVEL : R/W; bitpos: [3]; default: 1;
 *  This register is used to configure the ACK value that need to sent by master when
 *  the rx_fifo_cnt has reached the threshold.
 */
#define LP_I2C_RX_FULL_ACK_LEVEL    (BIT(3))
#define LP_I2C_RX_FULL_ACK_LEVEL_M  (LP_I2C_RX_FULL_ACK_LEVEL_V << LP_I2C_RX_FULL_ACK_LEVEL_S)
#define LP_I2C_RX_FULL_ACK_LEVEL_V  0x00000001U
#define LP_I2C_RX_FULL_ACK_LEVEL_S  3
/** LP_I2C_TRANS_START : WT; bitpos: [5]; default: 0;
 *  Set this bit to start sending the data in txfifo.
 */
#define LP_I2C_TRANS_START    (BIT(5))
#define LP_I2C_TRANS_START_M  (LP_I2C_TRANS_START_V << LP_I2C_TRANS_START_S)
#define LP_I2C_TRANS_START_V  0x00000001U
#define LP_I2C_TRANS_START_S  5
/** LP_I2C_TX_LSB_FIRST : R/W; bitpos: [6]; default: 0;
 *  This bit is used to control the sending mode for data needing to be sent. 1: send
 *  data from the least significant bit,0: send data from the most significant bit.
 */
#define LP_I2C_TX_LSB_FIRST    (BIT(6))
#define LP_I2C_TX_LSB_FIRST_M  (LP_I2C_TX_LSB_FIRST_V << LP_I2C_TX_LSB_FIRST_S)
#define LP_I2C_TX_LSB_FIRST_V  0x00000001U
#define LP_I2C_TX_LSB_FIRST_S  6
/** LP_I2C_RX_LSB_FIRST : R/W; bitpos: [7]; default: 0;
 *  This bit is used to control the storage mode for received data.1: receive data from
 *  the least significant bit,0: receive data from the most significant bit.
 */
#define LP_I2C_RX_LSB_FIRST    (BIT(7))
#define LP_I2C_RX_LSB_FIRST_M  (LP_I2C_RX_LSB_FIRST_V << LP_I2C_RX_LSB_FIRST_S)
#define LP_I2C_RX_LSB_FIRST_V  0x00000001U
#define LP_I2C_RX_LSB_FIRST_S  7
/** LP_I2C_CLK_EN : R/W; bitpos: [8]; default: 0;
 *  Reserved
 */
#define LP_I2C_CLK_EN    (BIT(8))
#define LP_I2C_CLK_EN_M  (LP_I2C_CLK_EN_V << LP_I2C_CLK_EN_S)
#define LP_I2C_CLK_EN_V  0x00000001U
#define LP_I2C_CLK_EN_S  8
/** LP_I2C_ARBITRATION_EN : R/W; bitpos: [9]; default: 1;
 *  This is the enable bit for arbitration_lost.
 */
#define LP_I2C_ARBITRATION_EN    (BIT(9))
#define LP_I2C_ARBITRATION_EN_M  (LP_I2C_ARBITRATION_EN_V << LP_I2C_ARBITRATION_EN_S)
#define LP_I2C_ARBITRATION_EN_V  0x00000001U
#define LP_I2C_ARBITRATION_EN_S  9
/** LP_I2C_FSM_RST : WT; bitpos: [10]; default: 0;
 *  This register is used to reset the scl FMS.
 */
#define LP_I2C_FSM_RST    (BIT(10))
#define LP_I2C_FSM_RST_M  (LP_I2C_FSM_RST_V << LP_I2C_FSM_RST_S)
#define LP_I2C_FSM_RST_V  0x00000001U
#define LP_I2C_FSM_RST_S  10
/** LP_I2C_CONF_UPGATE : WT; bitpos: [11]; default: 0;
 *  synchronization bit
 */
#define LP_I2C_CONF_UPGATE    (BIT(11))
#define LP_I2C_CONF_UPGATE_M  (LP_I2C_CONF_UPGATE_V << LP_I2C_CONF_UPGATE_S)
#define LP_I2C_CONF_UPGATE_V  0x00000001U
#define LP_I2C_CONF_UPGATE_S  11

/** LP_I2C_SR_REG register
 *  Describe I2C work status.
 */
#define LP_I2C_SR_REG (DR_REG_LP_I2C_BASE + 0x8)
/** LP_I2C_RESP_REC : RO; bitpos: [0]; default: 0;
 *  The received ACK value in master mode or slave mode. 0: ACK, 1: NACK.
 */
#define LP_I2C_RESP_REC    (BIT(0))
#define LP_I2C_RESP_REC_M  (LP_I2C_RESP_REC_V << LP_I2C_RESP_REC_S)
#define LP_I2C_RESP_REC_V  0x00000001U
#define LP_I2C_RESP_REC_S  0
/** LP_I2C_ARB_LOST : RO; bitpos: [3]; default: 0;
 *  When the I2C controller loses control of SCL line, this register changes to 1.
 */
#define LP_I2C_ARB_LOST    (BIT(3))
#define LP_I2C_ARB_LOST_M  (LP_I2C_ARB_LOST_V << LP_I2C_ARB_LOST_S)
#define LP_I2C_ARB_LOST_V  0x00000001U
#define LP_I2C_ARB_LOST_S  3
/** LP_I2C_BUS_BUSY : RO; bitpos: [4]; default: 0;
 *  1: the I2C bus is busy transferring data, 0: the I2C bus is in idle state.
 */
#define LP_I2C_BUS_BUSY    (BIT(4))
#define LP_I2C_BUS_BUSY_M  (LP_I2C_BUS_BUSY_V << LP_I2C_BUS_BUSY_S)
#define LP_I2C_BUS_BUSY_V  0x00000001U
#define LP_I2C_BUS_BUSY_S  4
/** LP_I2C_RXFIFO_CNT : RO; bitpos: [12:8]; default: 0;
 *  This field represents the amount of data needed to be sent.
 */
#define LP_I2C_RXFIFO_CNT    0x0000001FU
#define LP_I2C_RXFIFO_CNT_M  (LP_I2C_RXFIFO_CNT_V << LP_I2C_RXFIFO_CNT_S)
#define LP_I2C_RXFIFO_CNT_V  0x0000001FU
#define LP_I2C_RXFIFO_CNT_S  8
/** LP_I2C_TXFIFO_CNT : RO; bitpos: [22:18]; default: 0;
 *  This field stores the amount of received data in RAM.
 */
#define LP_I2C_TXFIFO_CNT    0x0000001FU
#define LP_I2C_TXFIFO_CNT_M  (LP_I2C_TXFIFO_CNT_V << LP_I2C_TXFIFO_CNT_S)
#define LP_I2C_TXFIFO_CNT_V  0x0000001FU
#define LP_I2C_TXFIFO_CNT_S  18
/** LP_I2C_SCL_MAIN_STATE_LAST : RO; bitpos: [26:24]; default: 0;
 *  This field indicates the states of the I2C module state machine. 0: Idle, 1:
 *  Address shift, 2: ACK address, 3: Rx data, 4: Tx data, 5: Send ACK, 6: Wait ACK
 */
#define LP_I2C_SCL_MAIN_STATE_LAST    0x00000007U
#define LP_I2C_SCL_MAIN_STATE_LAST_M  (LP_I2C_SCL_MAIN_STATE_LAST_V << LP_I2C_SCL_MAIN_STATE_LAST_S)
#define LP_I2C_SCL_MAIN_STATE_LAST_V  0x00000007U
#define LP_I2C_SCL_MAIN_STATE_LAST_S  24
/** LP_I2C_SCL_STATE_LAST : RO; bitpos: [30:28]; default: 0;
 *  This field indicates the states of the state machine used to produce SCL.0: Idle,
 *  1: Start, 2: Negative edge, 3: Low, 4: Positive edge, 5: High, 6: Stop
 */
#define LP_I2C_SCL_STATE_LAST    0x00000007U
#define LP_I2C_SCL_STATE_LAST_M  (LP_I2C_SCL_STATE_LAST_V << LP_I2C_SCL_STATE_LAST_S)
#define LP_I2C_SCL_STATE_LAST_V  0x00000007U
#define LP_I2C_SCL_STATE_LAST_S  28

/** LP_I2C_TO_REG register
 *  Setting time out control for receiving data.
 */
#define LP_I2C_TO_REG (DR_REG_LP_I2C_BASE + 0xc)
/** LP_I2C_TIME_OUT_VALUE : R/W; bitpos: [4:0]; default: 16;
 *  This register is used to configure the timeout for receiving a data bit in APBclock
 *  cycles.
 */
#define LP_I2C_TIME_OUT_VALUE    0x0000001FU
#define LP_I2C_TIME_OUT_VALUE_M  (LP_I2C_TIME_OUT_VALUE_V << LP_I2C_TIME_OUT_VALUE_S)
#define LP_I2C_TIME_OUT_VALUE_V  0x0000001FU
#define LP_I2C_TIME_OUT_VALUE_S  0
/** LP_I2C_TIME_OUT_EN : R/W; bitpos: [5]; default: 0;
 *  This is the enable bit for time out control.
 */
#define LP_I2C_TIME_OUT_EN    (BIT(5))
#define LP_I2C_TIME_OUT_EN_M  (LP_I2C_TIME_OUT_EN_V << LP_I2C_TIME_OUT_EN_S)
#define LP_I2C_TIME_OUT_EN_V  0x00000001U
#define LP_I2C_TIME_OUT_EN_S  5

/** LP_I2C_FIFO_ST_REG register
 *  FIFO status register.
 */
#define LP_I2C_FIFO_ST_REG (DR_REG_LP_I2C_BASE + 0x14)
/** LP_I2C_RXFIFO_RADDR : RO; bitpos: [3:0]; default: 0;
 *  This is the offset address of the APB reading from rxfifo
 */
#define LP_I2C_RXFIFO_RADDR    0x0000000FU
#define LP_I2C_RXFIFO_RADDR_M  (LP_I2C_RXFIFO_RADDR_V << LP_I2C_RXFIFO_RADDR_S)
#define LP_I2C_RXFIFO_RADDR_V  0x0000000FU
#define LP_I2C_RXFIFO_RADDR_S  0
/** LP_I2C_RXFIFO_WADDR : RO; bitpos: [8:5]; default: 0;
 *  This is the offset address of i2c module receiving data and writing to rxfifo.
 */
#define LP_I2C_RXFIFO_WADDR    0x0000000FU
#define LP_I2C_RXFIFO_WADDR_M  (LP_I2C_RXFIFO_WADDR_V << LP_I2C_RXFIFO_WADDR_S)
#define LP_I2C_RXFIFO_WADDR_V  0x0000000FU
#define LP_I2C_RXFIFO_WADDR_S  5
/** LP_I2C_TXFIFO_RADDR : RO; bitpos: [13:10]; default: 0;
 *  This is the offset address of i2c module reading from txfifo.
 */
#define LP_I2C_TXFIFO_RADDR    0x0000000FU
#define LP_I2C_TXFIFO_RADDR_M  (LP_I2C_TXFIFO_RADDR_V << LP_I2C_TXFIFO_RADDR_S)
#define LP_I2C_TXFIFO_RADDR_V  0x0000000FU
#define LP_I2C_TXFIFO_RADDR_S  10
/** LP_I2C_TXFIFO_WADDR : RO; bitpos: [18:15]; default: 0;
 *  This is the offset address of APB bus writing to txfifo.
 */
#define LP_I2C_TXFIFO_WADDR    0x0000000FU
#define LP_I2C_TXFIFO_WADDR_M  (LP_I2C_TXFIFO_WADDR_V << LP_I2C_TXFIFO_WADDR_S)
#define LP_I2C_TXFIFO_WADDR_V  0x0000000FU
#define LP_I2C_TXFIFO_WADDR_S  15

/** LP_I2C_FIFO_CONF_REG register
 *  FIFO configuration register.
 */
#define LP_I2C_FIFO_CONF_REG (DR_REG_LP_I2C_BASE + 0x18)
/** LP_I2C_RXFIFO_WM_THRHD : R/W; bitpos: [3:0]; default: 6;
 *  The water mark threshold of rx FIFO in nonfifo access mode. When
 *  reg_reg_fifo_prt_en is 1 and rx FIFO counter is bigger than
 *  reg_rxfifo_wm_thrhd[3:0], reg_rxfifo_wm_int_raw bit will be valid.
 */
#define LP_I2C_RXFIFO_WM_THRHD    0x0000000FU
#define LP_I2C_RXFIFO_WM_THRHD_M  (LP_I2C_RXFIFO_WM_THRHD_V << LP_I2C_RXFIFO_WM_THRHD_S)
#define LP_I2C_RXFIFO_WM_THRHD_V  0x0000000FU
#define LP_I2C_RXFIFO_WM_THRHD_S  0
/** LP_I2C_TXFIFO_WM_THRHD : R/W; bitpos: [8:5]; default: 2;
 *  The water mark threshold of tx FIFO in nonfifo access mode. When
 *  reg_reg_fifo_prt_en is 1 and tx FIFO counter is smaller than
 *  reg_txfifo_wm_thrhd[3:0], reg_txfifo_wm_int_raw bit will be valid.
 */
#define LP_I2C_TXFIFO_WM_THRHD    0x0000000FU
#define LP_I2C_TXFIFO_WM_THRHD_M  (LP_I2C_TXFIFO_WM_THRHD_V << LP_I2C_TXFIFO_WM_THRHD_S)
#define LP_I2C_TXFIFO_WM_THRHD_V  0x0000000FU
#define LP_I2C_TXFIFO_WM_THRHD_S  5
/** LP_I2C_NONFIFO_EN : R/W; bitpos: [10]; default: 0;
 *  Set this bit to enable APB nonfifo access.
 */
#define LP_I2C_NONFIFO_EN    (BIT(10))
#define LP_I2C_NONFIFO_EN_M  (LP_I2C_NONFIFO_EN_V << LP_I2C_NONFIFO_EN_S)
#define LP_I2C_NONFIFO_EN_V  0x00000001U
#define LP_I2C_NONFIFO_EN_S  10
/** LP_I2C_RX_FIFO_RST : R/W; bitpos: [12]; default: 0;
 *  Set this bit to reset rx-fifo.
 */
#define LP_I2C_RX_FIFO_RST    (BIT(12))
#define LP_I2C_RX_FIFO_RST_M  (LP_I2C_RX_FIFO_RST_V << LP_I2C_RX_FIFO_RST_S)
#define LP_I2C_RX_FIFO_RST_V  0x00000001U
#define LP_I2C_RX_FIFO_RST_S  12
/** LP_I2C_TX_FIFO_RST : R/W; bitpos: [13]; default: 0;
 *  Set this bit to reset tx-fifo.
 */
#define LP_I2C_TX_FIFO_RST    (BIT(13))
#define LP_I2C_TX_FIFO_RST_M  (LP_I2C_TX_FIFO_RST_V << LP_I2C_TX_FIFO_RST_S)
#define LP_I2C_TX_FIFO_RST_V  0x00000001U
#define LP_I2C_TX_FIFO_RST_S  13
/** LP_I2C_FIFO_PRT_EN : R/W; bitpos: [14]; default: 1;
 *  The control enable bit of FIFO pointer in non-fifo access mode. This bit controls
 *  the valid bits and the interrupts of tx/rx_fifo overflow, underflow, full and empty.
 */
#define LP_I2C_FIFO_PRT_EN    (BIT(14))
#define LP_I2C_FIFO_PRT_EN_M  (LP_I2C_FIFO_PRT_EN_V << LP_I2C_FIFO_PRT_EN_S)
#define LP_I2C_FIFO_PRT_EN_V  0x00000001U
#define LP_I2C_FIFO_PRT_EN_S  14

/** LP_I2C_DATA_REG register
 *  Rx FIFO read data.
 */
#define LP_I2C_DATA_REG (DR_REG_LP_I2C_BASE + 0x1c)
/** LP_I2C_FIFO_RDATA : RO; bitpos: [7:0]; default: 0;
 *  The value of rx FIFO read data.
 */
#define LP_I2C_FIFO_RDATA    0x000000FFU
#define LP_I2C_FIFO_RDATA_M  (LP_I2C_FIFO_RDATA_V << LP_I2C_FIFO_RDATA_S)
#define LP_I2C_FIFO_RDATA_V  0x000000FFU
#define LP_I2C_FIFO_RDATA_S  0

/** LP_I2C_INT_RAW_REG register
 *  Raw interrupt status
 */
#define LP_I2C_INT_RAW_REG (DR_REG_LP_I2C_BASE + 0x20)
/** LP_I2C_RXFIFO_WM_INT_RAW : R/SS/WTC; bitpos: [0]; default: 0;
 *  The raw interrupt bit for LP_I2C_RXFIFO_WM_INT interrupt.
 */
#define LP_I2C_RXFIFO_WM_INT_RAW    (BIT(0))
#define LP_I2C_RXFIFO_WM_INT_RAW_M  (LP_I2C_RXFIFO_WM_INT_RAW_V << LP_I2C_RXFIFO_WM_INT_RAW_S)
#define LP_I2C_RXFIFO_WM_INT_RAW_V  0x00000001U
#define LP_I2C_RXFIFO_WM_INT_RAW_S  0
/** LP_I2C_TXFIFO_WM_INT_RAW : R/SS/WTC; bitpos: [1]; default: 1;
 *  The raw interrupt bit for LP_I2C_TXFIFO_WM_INT interrupt.
 */
#define LP_I2C_TXFIFO_WM_INT_RAW    (BIT(1))
#define LP_I2C_TXFIFO_WM_INT_RAW_M  (LP_I2C_TXFIFO_WM_INT_RAW_V << LP_I2C_TXFIFO_WM_INT_RAW_S)
#define LP_I2C_TXFIFO_WM_INT_RAW_V  0x00000001U
#define LP_I2C_TXFIFO_WM_INT_RAW_S  1
/** LP_I2C_RXFIFO_OVF_INT_RAW : R/SS/WTC; bitpos: [2]; default: 0;
 *  The raw interrupt bit for LP_I2C_RXFIFO_OVF_INT interrupt.
 */
#define LP_I2C_RXFIFO_OVF_INT_RAW    (BIT(2))
#define LP_I2C_RXFIFO_OVF_INT_RAW_M  (LP_I2C_RXFIFO_OVF_INT_RAW_V << LP_I2C_RXFIFO_OVF_INT_RAW_S)
#define LP_I2C_RXFIFO_OVF_INT_RAW_V  0x00000001U
#define LP_I2C_RXFIFO_OVF_INT_RAW_S  2
/** LP_I2C_END_DETECT_INT_RAW : R/SS/WTC; bitpos: [3]; default: 0;
 *  The raw interrupt bit for the LP_I2C_END_DETECT_INT interrupt.
 */
#define LP_I2C_END_DETECT_INT_RAW    (BIT(3))
#define LP_I2C_END_DETECT_INT_RAW_M  (LP_I2C_END_DETECT_INT_RAW_V << LP_I2C_END_DETECT_INT_RAW_S)
#define LP_I2C_END_DETECT_INT_RAW_V  0x00000001U
#define LP_I2C_END_DETECT_INT_RAW_S  3
/** LP_I2C_BYTE_TRANS_DONE_INT_RAW : R/SS/WTC; bitpos: [4]; default: 0;
 *  The raw interrupt bit for the LP_I2C_END_DETECT_INT interrupt.
 */
#define LP_I2C_BYTE_TRANS_DONE_INT_RAW    (BIT(4))
#define LP_I2C_BYTE_TRANS_DONE_INT_RAW_M  (LP_I2C_BYTE_TRANS_DONE_INT_RAW_V << LP_I2C_BYTE_TRANS_DONE_INT_RAW_S)
#define LP_I2C_BYTE_TRANS_DONE_INT_RAW_V  0x00000001U
#define LP_I2C_BYTE_TRANS_DONE_INT_RAW_S  4
/** LP_I2C_ARBITRATION_LOST_INT_RAW : R/SS/WTC; bitpos: [5]; default: 0;
 *  The raw interrupt bit for the LP_I2C_ARBITRATION_LOST_INT interrupt.
 */
#define LP_I2C_ARBITRATION_LOST_INT_RAW    (BIT(5))
#define LP_I2C_ARBITRATION_LOST_INT_RAW_M  (LP_I2C_ARBITRATION_LOST_INT_RAW_V << LP_I2C_ARBITRATION_LOST_INT_RAW_S)
#define LP_I2C_ARBITRATION_LOST_INT_RAW_V  0x00000001U
#define LP_I2C_ARBITRATION_LOST_INT_RAW_S  5
/** LP_I2C_MST_TXFIFO_UDF_INT_RAW : R/SS/WTC; bitpos: [6]; default: 0;
 *  The raw interrupt bit for LP_I2C_TRANS_COMPLETE_INT interrupt.
 */
#define LP_I2C_MST_TXFIFO_UDF_INT_RAW    (BIT(6))
#define LP_I2C_MST_TXFIFO_UDF_INT_RAW_M  (LP_I2C_MST_TXFIFO_UDF_INT_RAW_V << LP_I2C_MST_TXFIFO_UDF_INT_RAW_S)
#define LP_I2C_MST_TXFIFO_UDF_INT_RAW_V  0x00000001U
#define LP_I2C_MST_TXFIFO_UDF_INT_RAW_S  6
/** LP_I2C_TRANS_COMPLETE_INT_RAW : R/SS/WTC; bitpos: [7]; default: 0;
 *  The raw interrupt bit for the LP_I2C_TRANS_COMPLETE_INT interrupt.
 */
#define LP_I2C_TRANS_COMPLETE_INT_RAW    (BIT(7))
#define LP_I2C_TRANS_COMPLETE_INT_RAW_M  (LP_I2C_TRANS_COMPLETE_INT_RAW_V << LP_I2C_TRANS_COMPLETE_INT_RAW_S)
#define LP_I2C_TRANS_COMPLETE_INT_RAW_V  0x00000001U
#define LP_I2C_TRANS_COMPLETE_INT_RAW_S  7
/** LP_I2C_TIME_OUT_INT_RAW : R/SS/WTC; bitpos: [8]; default: 0;
 *  The raw interrupt bit for the LP_I2C_TIME_OUT_INT interrupt.
 */
#define LP_I2C_TIME_OUT_INT_RAW    (BIT(8))
#define LP_I2C_TIME_OUT_INT_RAW_M  (LP_I2C_TIME_OUT_INT_RAW_V << LP_I2C_TIME_OUT_INT_RAW_S)
#define LP_I2C_TIME_OUT_INT_RAW_V  0x00000001U
#define LP_I2C_TIME_OUT_INT_RAW_S  8
/** LP_I2C_TRANS_START_INT_RAW : R/SS/WTC; bitpos: [9]; default: 0;
 *  The raw interrupt bit for the LP_I2C_TRANS_START_INT interrupt.
 */
#define LP_I2C_TRANS_START_INT_RAW    (BIT(9))
#define LP_I2C_TRANS_START_INT_RAW_M  (LP_I2C_TRANS_START_INT_RAW_V << LP_I2C_TRANS_START_INT_RAW_S)
#define LP_I2C_TRANS_START_INT_RAW_V  0x00000001U
#define LP_I2C_TRANS_START_INT_RAW_S  9
/** LP_I2C_NACK_INT_RAW : R/SS/WTC; bitpos: [10]; default: 0;
 *  The raw interrupt bit for LP_I2C_SLAVE_STRETCH_INT interrupt.
 */
#define LP_I2C_NACK_INT_RAW    (BIT(10))
#define LP_I2C_NACK_INT_RAW_M  (LP_I2C_NACK_INT_RAW_V << LP_I2C_NACK_INT_RAW_S)
#define LP_I2C_NACK_INT_RAW_V  0x00000001U
#define LP_I2C_NACK_INT_RAW_S  10
/** LP_I2C_TXFIFO_OVF_INT_RAW : R/SS/WTC; bitpos: [11]; default: 0;
 *  The raw interrupt bit for LP_I2C_TXFIFO_OVF_INT interrupt.
 */
#define LP_I2C_TXFIFO_OVF_INT_RAW    (BIT(11))
#define LP_I2C_TXFIFO_OVF_INT_RAW_M  (LP_I2C_TXFIFO_OVF_INT_RAW_V << LP_I2C_TXFIFO_OVF_INT_RAW_S)
#define LP_I2C_TXFIFO_OVF_INT_RAW_V  0x00000001U
#define LP_I2C_TXFIFO_OVF_INT_RAW_S  11
/** LP_I2C_RXFIFO_UDF_INT_RAW : R/SS/WTC; bitpos: [12]; default: 0;
 *  The raw interrupt bit for LP_I2C_RXFIFO_UDF_INT  interrupt.
 */
#define LP_I2C_RXFIFO_UDF_INT_RAW    (BIT(12))
#define LP_I2C_RXFIFO_UDF_INT_RAW_M  (LP_I2C_RXFIFO_UDF_INT_RAW_V << LP_I2C_RXFIFO_UDF_INT_RAW_S)
#define LP_I2C_RXFIFO_UDF_INT_RAW_V  0x00000001U
#define LP_I2C_RXFIFO_UDF_INT_RAW_S  12
/** LP_I2C_SCL_ST_TO_INT_RAW : R/SS/WTC; bitpos: [13]; default: 0;
 *  The raw interrupt bit for LP_I2C_SCL_ST_TO_INT interrupt.
 */
#define LP_I2C_SCL_ST_TO_INT_RAW    (BIT(13))
#define LP_I2C_SCL_ST_TO_INT_RAW_M  (LP_I2C_SCL_ST_TO_INT_RAW_V << LP_I2C_SCL_ST_TO_INT_RAW_S)
#define LP_I2C_SCL_ST_TO_INT_RAW_V  0x00000001U
#define LP_I2C_SCL_ST_TO_INT_RAW_S  13
/** LP_I2C_SCL_MAIN_ST_TO_INT_RAW : R/SS/WTC; bitpos: [14]; default: 0;
 *  The raw interrupt bit for LP_I2C_SCL_MAIN_ST_TO_INT interrupt.
 */
#define LP_I2C_SCL_MAIN_ST_TO_INT_RAW    (BIT(14))
#define LP_I2C_SCL_MAIN_ST_TO_INT_RAW_M  (LP_I2C_SCL_MAIN_ST_TO_INT_RAW_V << LP_I2C_SCL_MAIN_ST_TO_INT_RAW_S)
#define LP_I2C_SCL_MAIN_ST_TO_INT_RAW_V  0x00000001U
#define LP_I2C_SCL_MAIN_ST_TO_INT_RAW_S  14
/** LP_I2C_DET_START_INT_RAW : R/SS/WTC; bitpos: [15]; default: 0;
 *  The raw interrupt bit for LP_I2C_DET_START_INT interrupt.
 */
#define LP_I2C_DET_START_INT_RAW    (BIT(15))
#define LP_I2C_DET_START_INT_RAW_M  (LP_I2C_DET_START_INT_RAW_V << LP_I2C_DET_START_INT_RAW_S)
#define LP_I2C_DET_START_INT_RAW_V  0x00000001U
#define LP_I2C_DET_START_INT_RAW_S  15

