espressif/esp-idf/components/soc/esp32c5/register/soc/lp_i2c_reg.h
/** LP_I2C_SDA_HOLD_REG register
 *  Configures the hold time after a negative SCL edge.
 */
#define LP_I2C_SDA_HOLD_REG (DR_REG_LP_I2C_BASE + 0x30)
/** LP_I2C_SDA_HOLD_TIME : R/W; bitpos: [8:0]; default: 0;
 *  This register is used to configure the time to hold the data after the negativeedge
 *  of SCL, in I2C module clock cycles.
 */
#define LP_I2C_SDA_HOLD_TIME    0x000001FFU
#define LP_I2C_SDA_HOLD_TIME_M  (LP_I2C_SDA_HOLD_TIME_V << LP_I2C_SDA_HOLD_TIME_S)
#define LP_I2C_SDA_HOLD_TIME_V  0x000001FFU
#define LP_I2C_SDA_HOLD_TIME_S  0

/** LP_I2C_SDA_SAMPLE_REG register
 *  Configures the sample time after a positive SCL edge.
 */
#define LP_I2C_SDA_SAMPLE_REG (DR_REG_LP_I2C_BASE + 0x34)
/** LP_I2C_SDA_SAMPLE_TIME : R/W; bitpos: [8:0]; default: 0;
 *  This register is used to configure for how long SDA is sampled, in I2C module clock
 *  cycles.
 */
#define LP_I2C_SDA_SAMPLE_TIME    0x000001FFU
#define LP_I2C_SDA_SAMPLE_TIME_M  (LP_I2C_SDA_SAMPLE_TIME_V << LP_I2C_SDA_SAMPLE_TIME_S)
#define LP_I2C_SDA_SAMPLE_TIME_V  0x000001FFU
#define LP_I2C_SDA_SAMPLE_TIME_S  0

/** LP_I2C_SCL_HIGH_PERIOD_REG register
 *  Configures the high level width of SCL
 */
#define LP_I2C_SCL_HIGH_PERIOD_REG (DR_REG_LP_I2C_BASE + 0x38)
/** LP_I2C_SCL_HIGH_PERIOD : R/W; bitpos: [8:0]; default: 0;
 *  This register is used to configure for how long SCL setup to high level and remains
 *  high in master mode, in I2C module clock cycles.
 */
#define LP_I2C_SCL_HIGH_PERIOD    0x000001FFU
#define LP_I2C_SCL_HIGH_PERIOD_M  (LP_I2C_SCL_HIGH_PERIOD_V << LP_I2C_SCL_HIGH_PERIOD_S)
#define LP_I2C_SCL_HIGH_PERIOD_V  0x000001FFU
#define LP_I2C_SCL_HIGH_PERIOD_S  0
/** LP_I2C_SCL_WAIT_HIGH_PERIOD : R/W; bitpos: [15:9]; default: 0;
 *  This register is used to configure for the SCL_FSM's waiting period for SCL high
 *  level in master mode, in I2C module clock cycles.
 */
#define LP_I2C_SCL_WAIT_HIGH_PERIOD    0x0000007FU
#define LP_I2C_SCL_WAIT_HIGH_PERIOD_M  (LP_I2C_SCL_WAIT_HIGH_PERIOD_V << LP_I2C_SCL_WAIT_HIGH_PERIOD_S)
#define LP_I2C_SCL_WAIT_HIGH_PERIOD_V  0x0000007FU
#define LP_I2C_SCL_WAIT_HIGH_PERIOD_S  9

/** LP_I2C_SCL_START_HOLD_REG register
 *  Configures the delay between the SDA and SCL negative edge for a start condition
 */
#define LP_I2C_SCL_START_HOLD_REG (DR_REG_LP_I2C_BASE + 0x40)
/** LP_I2C_SCL_START_HOLD_TIME : R/W; bitpos: [8:0]; default: 8;
 *  This register is used to configure the time between the negative edgeof SDA and the
 *  negative edge of SCL for a START condition, in I2C module clock cycles.
 */
#define LP_I2C_SCL_START_HOLD_TIME    0x000001FFU
#define LP_I2C_SCL_START_HOLD_TIME_M  (LP_I2C_SCL_START_HOLD_TIME_V << LP_I2C_SCL_START_HOLD_TIME_S)
#define LP_I2C_SCL_START_HOLD_TIME_V  0x000001FFU
#define LP_I2C_SCL_START_HOLD_TIME_S  0

/** LP_I2C_SCL_RSTART_SETUP_REG register
 *  Configures the delay between the positive
 *  edge of SCL and the negative edge of SDA
 */
#define LP_I2C_SCL_RSTART_SETUP_REG (DR_REG_LP_I2C_BASE + 0x44)
/** LP_I2C_SCL_RSTART_SETUP_TIME : R/W; bitpos: [8:0]; default: 8;
 *  This register is used to configure the time between the positiveedge of SCL and the
 *  negative edge of SDA for a RESTART condition, in I2C module clock cycles.
 */
#define LP_I2C_SCL_RSTART_SETUP_TIME    0x000001FFU
#define LP_I2C_SCL_RSTART_SETUP_TIME_M  (LP_I2C_SCL_RSTART_SETUP_TIME_V << LP_I2C_SCL_RSTART_SETUP_TIME_S)
#define LP_I2C_SCL_RSTART_SETUP_TIME_V  0x000001FFU
#define LP_I2C_SCL_RSTART_SETUP_TIME_S  0

/** LP_I2C_SCL_STOP_HOLD_REG register
 *  Configures the delay after the SCL clock
 *  edge for a stop condition
 */
#define LP_I2C_SCL_STOP_HOLD_REG (DR_REG_LP_I2C_BASE + 0x48)
/** LP_I2C_SCL_STOP_HOLD_TIME : R/W; bitpos: [8:0]; default: 8;
 *  This register is used to configure the delay after the STOP condition,in I2C module
 *  clock cycles.
 */
#define LP_I2C_SCL_STOP_HOLD_TIME    0x000001FFU
#define LP_I2C_SCL_STOP_HOLD_TIME_M  (LP_I2C_SCL_STOP_HOLD_TIME_V << LP_I2C_SCL_STOP_HOLD_TIME_S)
#define LP_I2C_SCL_STOP_HOLD_TIME_V  0x000001FFU
#define LP_I2C_SCL_STOP_HOLD_TIME_S  0

/** LP_I2C_SCL_STOP_SETUP_REG register
 *  Configures the delay between the SDA and
 *  SCL positive edge for a stop condition
 */
#define LP_I2C_SCL_STOP_SETUP_REG (DR_REG_LP_I2C_BASE + 0x4c)
/** LP_I2C_SCL_STOP_SETUP_TIME : R/W; bitpos: [8:0]; default: 8;
 *  This register is used to configure the time between the positive edgeof SCL and the
 *  positive edge of SDA, in I2C module clock cycles.
 */
#define LP_I2C_SCL_STOP_SETUP_TIME    0x000001FFU
#define LP_I2C_SCL_STOP_SETUP_TIME_M  (LP_I2C_SCL_STOP_SETUP_TIME_V << LP_I2C_SCL_STOP_SETUP_TIME_S)
#define LP_I2C_SCL_STOP_SETUP_TIME_V  0x000001FFU
#define LP_I2C_SCL_STOP_SETUP_TIME_S  0

/** LP_I2C_FILTER_CFG_REG register
 *  SCL and SDA filter configuration register
 */
#define LP_I2C_FILTER_CFG_REG (DR_REG_LP_I2C_BASE + 0x50)
/** LP_I2C_SCL_FILTER_THRES : R/W; bitpos: [3:0]; default: 0;
 *  When a pulse on the SCL input has smaller width than this register valuein I2C
 *  module clock cycles, the I2C controller will ignore that pulse.
 */
#define LP_I2C_SCL_FILTER_THRES    0x0000000FU
#define LP_I2C_SCL_FILTER_THRES_M  (LP_I2C_SCL_FILTER_THRES_V << LP_I2C_SCL_FILTER_THRES_S)
#define LP_I2C_SCL_FILTER_THRES_V  0x0000000FU
#define LP_I2C_SCL_FILTER_THRES_S  0
/** LP_I2C_SDA_FILTER_THRES : R/W; bitpos: [7:4]; default: 0;
 *  When a pulse on the SDA input has smaller width than this register valuein I2C
 *  module clock cycles, the I2C controller will ignore that pulse.
 */
#define LP_I2C_SDA_FILTER_THRES    0x0000000FU
#define LP_I2C_SDA_FILTER_THRES_M  (LP_I2C_SDA_FILTER_THRES_V << LP_I2C_SDA_FILTER_THRES_S)
#define LP_I2C_SDA_FILTER_THRES_V  0x0000000FU
#define LP_I2C_SDA_FILTER_THRES_S  4
/** LP_I2C_SCL_FILTER_EN : R/W; bitpos: [8]; default: 1;
 *  This is the filter enable bit for SCL.
 */
#define LP_I2C_SCL_FILTER_EN    (BIT(8))
#define LP_I2C_SCL_FILTER_EN_M  (LP_I2C_SCL_FILTER_EN_V << LP_I2C_SCL_FILTER_EN_S)
#define LP_I2C_SCL_FILTER_EN_V  0x00000001U
#define LP_I2C_SCL_FILTER_EN_S  8
/** LP_I2C_SDA_FILTER_EN : R/W; bitpos: [9]; default: 1;
 *  This is the filter enable bit for SDA.
 */
#define LP_I2C_SDA_FILTER_EN    (BIT(9))
#define LP_I2C_SDA_FILTER_EN_M  (LP_I2C_SDA_FILTER_EN_V << LP_I2C_SDA_FILTER_EN_S)
#define LP_I2C_SDA_FILTER_EN_V  0x00000001U
#define LP_I2C_SDA_FILTER_EN_S  9

